Repository: IliaGodlevsky/PathFinding
Catalog: PathFind/Pathfinding.App.Console/Localization/Languages.*.resx
Languages: ru

# AlgorithmChoiceMsg
source: Choose algorithm:
ru: Выберите алгоритм:

source: Apply history
ru: Применить историю

# ApplyHistoryMsg
source: Apply history recording {0}?:
ru: Применить историю {0}?:

# ApplyStatistics
source: Apply pathfinding statistics
ru: Применить статистику

# ApplyStatisticsMsg
source: Apply statistics {0}?:
ru: Применить статистику {0}?:

# ApplyVisualization
source: Apply pathfinding visualization
ru: Применить визуализацию

# ApplyVisualizationMsg
source: Apply visualization {0}?:
ru: Применить реализацию {0}?:

source: Assemble graph
ru: Собрать граф

# BadInputMsg
source: Bad value input. Try again:
ru: Неверный ввод. Попробуйте еще:

source: Black
ru: Черный

source: Blue
ru: Синий

source: Change cost
ru: Поменять стоимость

source: Change graph colors
ru: Поменять цвета графа

source: Change path colors
ru: Поменять цвета пути

source: Change pathfinding colors
ru: Поменять цвета поиска пути

source: Change range colors
ru: Поменять цвета диапазона поиска

source: Choose color:
ru: Выберите цвет:

# ClearColors
source: Clear vertices colors
ru: Очистить цвета вершин

source: Clear graph
ru: Очистить граф

source: Clear history
ru: Очистить историю

source: Clear pathfinding range
ru: Очистить даипазон пути

# ColorsUnitMenuItem
source: Colors
ru: Цвета

source: Crossed path color
ru: Цвет пересечения путей

# CustomSmoothLevel
source: Custom
ru: Пользовательский

source: Cyan
ru: Голубой

source: Dark blue
ru: Темно-синий

source: Dark cyan
ru: Темно-голубой

source: Dark gray
ru: Темно-серый

source: Dark green
ru: Темно-зеленый

source: Dark magenta
ru: Темно-пурпурный

source: Dark red
ru: Темно-красный

source: Dark yellow
ru: Темно-желтый

# DelayTimeInputMsg
source: Input animation speed delay time (milliseconds):
ru: Введите задержку аниманции (миллисекунды):

source: Enqueued color
ru: Цвет очередной вершины

source: Enter animation delay
ru: Ввод задержки анимации

source: Enter pathfinding range
ru: Ввод диапазона поиска пути

source: Exit
ru: Выйти

# ExitMsg
source: Do you want to exit {0}?:
ru: Вы хотите выйти {0}?:

source: Find path
ru: Поиск пути

source: Graph
ru: Граф

# GraphFormat
source: Obstacle percent: {0} ({1}/{2})
ru: Процент препятствий: {0} ({1}/{2})

# GraphHeightInputMsg
source: Input height of graph:
ru: Введите длину графа:

# GraphWidthInputMsg
source: Input width of graph:
ru: Введите ширину графа:

source: Gray
ru: Серый

source: Green
ru: Зеленый

# History
source: Pathfinding history
ru: История поиска пути

source: Input cost range
ru: Ввод диапазона цен

source: Input graph parametres
ru: Ввод параметров графа

source: Input host name:
ru: Введите имя хоста:

source: Input obstacle percent
ru: Ввод процента препятствий

# InputPathMsg
source: Input path:
ru: Введите путь:

source: Input port:
ru: Введите порт:

# InputServerNameMsg
source: Input server name:
ru: Введите имя сервера:

source: Language
ru: Язык

# LanguageMsg
source: Input language:
ru: Выберите язык:

# LengthDimensionName
source: Length
ru: Длина

source: Load graph
ru: Загрузить граф

source: Magenta
ru: Пурпурный

# MenuOptionChoiceMsg
source: Choose menu option:
ru: Выберите пункт меню:

source: No
ru: Нет

source: Obstacle color
ru: Цвет препятсвия

# ObstaclePercentInputMsg
source: Input percent of obstacles:
ru: Введите процент препятствий:

# OutOfRangeMsg
source: Value is out of range. Try again:
ru: Значение за пределами диапазона. Попробуйте еще:

source: Path color
ru: Цвет пути

source: Pathfinding
ru: Поиск пути

source: Pathfinding range
ru: Диапазон поиска пути

# PathfindingResultFormat
source: {0} Steps: {1} Path cost: {2}
ru: {0} Шаги: {1} Стоимость: {2}

source: Quit
ru: Выйти

# RangeLowerValueInputMsg
source: Input lower value of range:
ru: Введите нижнее значение диапазона:

# RangeUpperValueInputMsg
source: Input upper value of range:
ru: Введите верхнее значение диапазона:

source: Recieve graph
ru: Принять граф

source: Red
ru: Красный

source: Regular color
ru: Обычный цвет

source: Resize graph
ru: Изменить размер графа

source: Reverse vertices
ru: Перевернуть вершины

source: Save graph
ru: Сохранить граф

source: Send graph
ru: Отправить граф

source: Show history
ru: Показать историю

source: Source color
ru: Цвет источника

# Statistics
source: Pathfinding statistics
ru: Статистика поиска пути

# StatisticsFormat
source: {0} Time: {1} Visited: {2}
ru: {0} Время: {1} Посещенные: {2}

source: Target color
ru: Цвет цели

source: Transit color
ru: Цвет транзитной вершины

source: Visited color
ru: Цвет посещенной вершины

# Visual
source: Pathfinding visualization
ru: Визуализация поиска пути

source: Waiting for connection...
ru: Ожидание соединения...

source: White
ru: Белый

# WidthDimensionName
source: Width
ru: Ширина

source: Yellow
ru: Желтый

source: Yes
ru: Да
